In [1]:
import sqlite3
import pandas as pd

# Load the CSV into a DataFrame
df = pd.read_csv('used_car_price.csv')

#We will sqlite3 library and create a connection
conn = sqlite3.connect("sql_db.db")

# Write the DataFrame to the SQLite database as a table
df.to_sql('cars', conn, index=False, if_exists='replace')

#Load the sql module to ipython
%load_ext sql

#Load local dataset
%sql sqlite:///sql_db.db

## SQL GROUP BY Statement
- The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

- The GROUP BY statement is often used with aggregate functions `(COUNT(), MAX(), MIN(), SUM(), AVG())` to group the result-set by one or more columns.

- Syntax:
```
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);
```

In [2]:
%%sql

select brand, count(brand) as total_car
from cars
group by brand
order by count(brand) desc
limit 6;

 * sqlite:///sql_db.db
Done.

[('Ford', 23088),
 ('Mercedes-Benz', 19172),
 ('BMW', 17028),
 ('Chevrolet', 16335),
 ('Audi', 10887),
 ('Porsche', 10612)]

## SQL HAVING Clause
- The `HAVING` clause was added to SQL because the `WHERE` keyword cannot be used with aggregate function.
- Syntax:
```
SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
HAVING condition
ORDER BY column_name(s);
```

In [3]:
%%sql

select brand, model, count(model) as total_cars
from cars
group by model
having count(model) > 1000
order by count(model) desc;

 * sqlite:///sql_db.db
Done.

[('Ford', 'F-150 XLT', 2945),
 ('BMW', 'M3 Base', 2229),
 ('Chevrolet', 'Camaro 2SS', 1709),
 ('BMW', 'M4 Base', 1622),
 ('Ford', 'Mustang GT Premium', 1526),
 ('Ford', 'F-150 Lariat', 1410),
 ('Mercedes-Benz', 'E-Class E 350 4MATIC', 1357),
 ('RAM', '1500 Laramie', 1249),
 ('Porsche', '911 Carrera S', 1219),
 ('Chevrolet', 'Corvette Base', 1184),
 ('Mercedes-Benz', 'E-Class E 350', 1148),
 ('Lexus', 'GX 460 Base', 1124),
 ('Porsche', '911 Carrera', 1111),
 ('Ford', 'Explorer XLT', 1091),
 ('Chevrolet', 'Corvette Stingray w/2LT', 1081),
 ('Land', 'Rover Range Rover Sport HSE', 1027),
 ('Jeep', 'Wrangler Sport', 1001)]

In [4]:
%%sql
-- return only ford cars model with their counts

select model, count(model) as total_cars
from cars
where brand = 'Ford'
group by model
having count(model) > 1000
order by count(model) desc;

 * sqlite:///sql_db.db
Done.

[('F-150 XLT', 2934),
 ('Mustang GT Premium', 1515),
 ('F-150 Lariat', 1404),
 ('Explorer XLT', 1083)]

## SQL ANY and ALL Operators
- The ANY and ALL operators allow you to perform a comparison between a single column value and a range of other values.
### The `ANY` Operator:
    - returns a boolean value as a result.
    - returns TRUE if ANY of the subquery values meet the condition.
    - ANY Means that the condition will be true if the operation is true for any of the values in the range.

- Syntax:
```
SELECT column_name(s)
FROM table_name
WHERE column_name operator ANY
  (SELECT column_name
  FROM table_name
  WHERE condition);
```

- For Example:
```
SELECT ProductName
FROM Products
WHERE ProductID = ANY
(SELECT ProductID
FROM OrderDetails
WHERE Quantity > 1000);
```

### The `ALL` Operator:
    - returns a boolean value as a result.
    - returns TRUE if ALL of the subquery values meet the codtion
    - is used with `SELECT`, `WHERE`, `HAVING` statement.
- Syntax:
```
SELECT ALL column_name(s)
FROM table_name
WHERE condition;
```

- For Example:
```
SELECT ProductName
FROM Products
WHERE ProductID = ALL
  (SELECT ProductID
  FROM OrderDetails
  WHERE Quantity = 10);
```

# SQL SELECT INTO Statement
- The `SELECT INTO` statement copies data from one table into a new table.

In [5]:
%%sql

select * into luxury_cars 
from cars 
where price > 1000000;

 * sqlite:///sql_db.db
(sqlite3.OperationalError) near "into": syntax error
[SQL: select * into luxury_cars
from cars
where price > 1000000;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# SQL INSERT INTO SELECT Statement
- The INSERT INTO SELECT statement copies data from one table and inserts it into another table.
- Syntax:
```
INSERT INTO table2
SELECT * FROM table1
WHERE condition;
```

In [6]:
%%sql
-- create a new table

insert into luxury_cars
select * 
from cars 
where price > 100000;

 * sqlite:///sql_db.db
(sqlite3.OperationalError) no such table: luxury_cars
[SQL: -- create a new table

insert into luxury_cars
select *
from cars
where price > 100000;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)